configuration/src/InformationRegisters/СрокиСдачиЗадач/СрокиСдачиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СрокиСдачиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СрокСдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ИсторияИзмененийОбъектовПоСобытиям/ИсторияИзмененийОбъектовПоСобытиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененийОбъектовПоСобытиям</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСобытия</name>
    <type>
      <types>EnumRef.КатегорииСобытийИсторияИзменений</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектИсторииИзменений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСобытия</name>
    <comment>Хранит номер события в периоде (при изменении объектов может быть несколько записей)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/Комментарии/Комментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Комментарии</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <comment>Текст комментария в HTML</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <comment>Автор комментария</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Важный</name>
    <comment>Комментарий является важным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения комментария</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторJira</name>
    <comment>Используется для хранения идентификатора комментария из Jira</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Общедоступный</name>
    <comment>Истина - комментарий виден всем, Ложь - виден только группе разработки автора комментария</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаJira</name>
    <comment>Используется для хранения почты автора комментария из Jira</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <comment>Комментарий является служебным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец комментария</comment>
    <type>
      <types>DefinedType.ИсточникКомментариев</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомментария</name>
    <comment>Идентификатор комментария</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/КатегорииСобытийИсторияИзменений/КатегорииСобытийИсторияИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСобытийИсторияИзменений</name>
  <enumValues>
    <name>Главное</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПорядкаОчереди</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/СрокиСдачиЗадач/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает дату сдачи задачи.
//
// Параметры:
//  Задача - ДокументСсылка.Задача - объект, для которого нужно получить дату сдачи.
//
// Возвращаемое значение:
//  Дата.
//
Функция ПолучитьСрокСдачиЗадачи(Знач Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СрокиСдачиЗадачСрезПоследних.СрокСдачи КАК СрокСдачи
	|ИЗ
	|	РегистрСведений.СрокиСдачиЗадач.СрезПоследних(, Задача = &Задача) КАК СрокиСдачиЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		СрокСдачи = Выборка.СрокСдачи;
	Иначе
		СрокСдачи = Дата(1,1,1);
	КонецЕсли;
	
	Возврат СрокСдачи;
	
КонецФункции

// Добавляет запись в регистр
//
// Параметры:
//  Задача	    - ДокументСсылка.Задача	 - задача
//  СрокСдачи   - Дата - устанавливаемая дата сдачи задачи
//  Комментарий - Строка - причина добавления срока
//
Процедура СохранитьСрокСдачи(Знач Задача, Знач Дата, Знач ДатаДоИзменения = Неопределено, Знач Комментарий = "") Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.СрокСдачи = Дата;
	МенеджерЗаписи.Комментарий = Комментарий;	
	МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;	
		
	Если ЗначениеЗаполнено(Комментарий) Тогда		
		ШаблонСобщения = "<b>Новый срок сдачи</b>: %1" + Символы.ПС + "<b>Причина</b>: %2";
		СрокСдачи = Формат(Дата, "ДФ='dd.MM.yyyy'");
		ТекстСообщения = СтрШаблон(ШаблонСобщения, СрокСдачи, Комментарий);

		ДанныеСтруктура = Новый Структура;
		ДанныеСтруктура.Вставить("Событие", "ИзменениеРеквизита");
		ДанныеСтруктура.Вставить("Реквизит", "СрокСдачи");
		
		Если ДатаДоИзменения <> Неопределено Тогда
			ДатаДоИзменения = Формат(ДатаДоИзменения, "ДФ='dd.MM.yyyy'");
			ДанныеСтруктура.Вставить("СтароеЗначение", ДатаДоИзменения);
		КонецЕсли;
		
		ДанныеСтруктура.Вставить("НовоеЗначение", СрокСдачи);
		ДанныеСтруктура.Вставить("Причина", Комментарий);
		
		СтруктураСообщение = ОбщегоНазначения.ПолучитьСтруктуруДанныхДляЗаписиВИсторию(Ложь);
		СтруктураСообщение.Данные = ЗаписатьЗначениеJSON(ДанныеСтруктура);
		СтруктураСообщение.Категория = Перечисления.КатегорииСобытийИсторияИзменений.Прочее;
				
		НачатьТранзакцию();
		Попытка
			МенеджерЗаписи.Записать();
			РегистрыСведений.ИсторияИзмененийОбъектовПоСобытиям.Добавить(Задача, СтруктураСообщение);
			РегистрыСведений.Комментарии.Добавить(Задача, , , ТекстСообщения, , Истина);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();			
			ИмяСобытия = "РегистрСведений.СрокиСдачиЗадач.ИзменениеСрокаСдачи";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
	Иначе
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
